In [17]:
import pandas as pd
df = pd.read_csv('NaNDataset.csv')
df.isnull().sum()

A    0
B    2
C    0
dtype: int64

In [16]:
df.B=df.B.fillna(df.B.mean())
df

    A     B   C
0   1   2.0   3
1   4  11.0   6
2   7  11.0   9
3  10  11.0  12
4  13  14.0  15
5  16  17.0  18

In [19]:
df = df.dropna()
df

    A     B   C
0   1   2.0   3
3  10  11.0  12
4  13  14.0  15
5  16  17.0  18

In [20]:
df=df.reset_index(drop=True)
df

    A     B   C
0   1   2.0   3
1  10  11.0  12
2  13  14.0  15
3  16  17.0  18

In [22]:
df=pd.read_csv('DuplicateRows.csv')
df.duplicated(keep=False)

0    False
1    False
2    False
3    False
4     True
5     True
6    False
7    False
dtype: bool

In [24]:
df[df.duplicated(keep=False)]

    A   B   C
4  10  11  12
5  10  11  12

In [25]:
df.drop_duplicates(subset=['A','C'],keep='last',inplace=True)
df

    A   B   C
0   1   2   3
1   4   5   6
3   7  18   9
5  10  11  12
6  13  14  15
7  16  17  18

In [28]:
from sklearn import preprocessing
df=pd.read_csv('NormalizeColumns.csv')
x= df.values.astype(float)
min_max_scaler = preprocessing.MinMaxScaler()
x_scaled = min_max_scaler.fit_transform(x)
df= pd.DataFrame(x_scaled,columns=df.columns)
df

     A         B    C
0  0.6  0.000000  0.0
1  0.2  0.200000  0.2
2  0.4  0.266667  0.4
3  0.0  0.600000  0.6
4  0.8  0.800000  0.8
5  1.0  1.000000  1.0

In [29]:
import numpy as np
def outliers_iqr(data):
    q1,q3=np.percentile(data,[25,75])
    iqr = q3 -q1
    lower_bound=q1-(iqr*1.5)
    upper_bound=q3+(iqr*1.5)
    return np.where((data>upper_bound) | (data<lower_bound))

In [37]:
import pandas as pd
df=pd.read_csv('galton.csv')
df.head()

   family  father  mother sex  height  nkids
0       1    78.5    67.0   M    73.2      4
1       1    78.5    67.0   F    69.2      4
2       1    78.5    67.0   F    69.0      4
3       1    78.5    67.0   F    69.0      4
4       2    75.5    66.5   M    73.5      4

In [38]:
print('Outlier using ourliers_iqr()')
print('================================')
for i in outliers_iqr(df.height)[0]:
    print(df[i:i+1])

Outlier using ourliers_iqr()
================================

In [39]:
def outliers_z_score(data):
    threshold=3
    mean = np.mean(data)
    std= np.std(data)
    z_scores=[(y-mean)/std for y in data]
    return np.where(np.abs(z_scores)>threshold)
print('Outliers using ourliers_z_score()')
print('=================================')
for i in outliers_z_score(df.height)[0]:
    print(df[i:i+1])

Outliers using ourliers_z_score()
=================================

In [40]:
def outliers_z_score(data):
    threshold=3
    mean = np.mean(data)
    std= np.std(data)
    z_scores=[(y-mean)/std for y in data]
    return np.where(np.abs(z_scores)>threshold)

In [41]:
print('Outliers using ourliers_z_score()')
print('=================================')
for i in outliers_z_score(df.height)[0]:
    print(df[i:i+1])

Outliers using ourliers_z_score()
=================================